# Дата занятия: 02.10.2026

# =============================================================================
# Задача 1. Кратчайший путь в ориентированном графе
# =============================================================================
"""
В текстовом файле содержится описание ациклического ориентированного взвешенного графа. В каждой строке файла записаны два натуральных числа (L, M и одно положительное вещественное число (W). L и M — номера вершин графа, W — вес ребра, ведущего из вершины L в вершину M. Таким образом, количество строк в файле равно количеству рёбер в графе. Две вершины графа не могут быть соединены более чем одним ребром.

Найдите и запишите в ответе целую часть длины кратчайшего пути из вершины с номером 150 в вершину с номером 923. Существование хотя бы одного такого пути гарантируется. Под длиной кратчайшего пути понимается минимальная сумма весов рёбер, составляющих путь.

Для выполнения этого задания следует написать программу.

Вершины графа могут быть пронумерованы не подряд. L≤1000, M≤1000; W≤10 000. Количество строк в файле не превосходит 200. Числа в строках разделены произвольным ненулевым количеством пробелов и/или табуляций.

Типовой пример организации данных во входном файле для графа на рисунке
"""

# Идея решения:
# Считываем рёбра и храним кратчайшие найденные расстояния от вершины 150.
# Многократно просматриваем все рёбра: если путь через очередное ребро короче,
# обновляем расстояние до его конечной вершины.

# Открываем файл с описанием рёбер и готовим список для их хранения.
f = open('data.txt')
data = []

# В каждой строке выделяем начало и конец ребра, а также его вес.
for line in f:
    n1, n2, n3 = line.split()
    data.append([int(n1), int(n2), float(n3)])

# Готовим расстояния для номеров вершин от 0 до 1000.
n = 1000 + 1
start = 150
dist = [float('inf')] * n
dist[start] = 0

# Повторно проходим по всем рёбрам и обновляем найденные расстояния.
for i in range(n - 1):
    for a, b, c in data:
        if dist[a] + c < dist[b]:
            dist[b] = dist[a] + c

# Выводим найденное расстояние до вершины 923.
print(dist[923])
